Revit 2027 API
EmbodiedCarbonAsset.EqualsEmbodiedCarbonOnly Method
 Determines whether this embodied carbon asset is equal to another, but ignore data from base class.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool EqualsEmbodiedCarbonOnly(
	EmbodiedCarbonAsset other
)
Public Function EqualsEmbodiedCarbonOnly (
	other As EmbodiedCarbonAsset
) As Boolean
public:
bool EqualsEmbodiedCarbonOnly(
	EmbodiedCarbonAsset^ other
)
member EqualsEmbodiedCarbonOnly :
        other : EmbodiedCarbonAsset -> bool
Parameters
other EmbodiedCarbonAsset
 The embodied carbon asset to compare with this one.
Return Value
Boolean
 True if the given embodied carbon asset is equal to this one, otherwise false.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
EmbodiedCarbonAsset Class
Autodesk.Revit.DB Namespace